package ACM.UpdatingADictionary;

/**
 * Created with IntelliJ IDEA.
 * User:ChengLiang
 * Date:2017/5/9
 * Time:17:42
 * <p>
 * 在本题中，字典是若干键值对，其中键为小写字母组成的字符串，值为没有前导零或正
 * 号的非负整数（-4，03和+77都是非法的，注意该整数可以很大）。输入一个旧字典和一个
 * 新字典，计算二者的变化。输入的两个字典中键都是唯一的，但是排列顺序任意。具体格式
 * 为（注意字典格式中不含任何空白字符）：
 * {key:value,key:value,…,key:value}
 * 输入包含两行，各包含不超过100个字符，即旧字典和新字典。输出格式如下：
 * 如果至少有一个新增键，打印一个“+”号，然后是所有新增键，按字典序从小到大排
 * 列。
 * 如果至少有一个删除键，打印一个“-”号，然后是所有删除键，按字典序从小到大排
 * 列。
 * 如果至少有一个修改键，打印一个“*”号，然后是所有修改键，按字典序从小到大排
 * 列。
 * 如果没有任何修改，输出No changes。
 * 例如，若输入两行分别为{a:3,b:4,c:10,f:6}和{a:3,c:5,d:10,ee:4}，输出为以下3行：
 * +d,ee；-b,f； * c。
 * <p>
 * <p>
 * Updating a Dictionary, UVa12504
 */
public class Solution {


}
